---
kind: method
id: M:Autodesk.Revit.DB.ExportFontInfo.Dispose
source: html/69c88357-8e5c-e6ba-377e-6177e262e945.htm
---
# Autodesk.Revit.DB.ExportFontInfo.Dispose Method

Releases all resources used by the ExportFontInfo

## Syntax (C#)
```csharp
public void Dispose()
```